{
  "posts": [
    {
      "id": 1,
      "title": "My First Blog Post",
      "body": "This is an example blog post."
    },
    {
      "id": 2,
      "title": "What My Fitness Journey Taught Me About Discipline and Learning to Code",
      "body": "Starting my fitness journey was one of the most challenging but rewarding decisions I’ve ever made. ..."
    },
    {
      "id": 3,
      "title": "Top 5 React Best Practices in 2025",
      "body": "React continues to evolve and mastering best practices ensures your apps are performant and maintainable.\n\n1. Use Functional Components & Hooks: Functional components are now standard. Hooks like useState and useEffect simplify state management.\n2. **Component Reusability:** Build small, reusable components for cleaner code and faster development.\n3. **Lazy Loading & Code Splitting:** Improve performance by loading only what’s needed.\n4. **Type Checking:** Use PropTypes or TypeScript for safer components.\n5. **State Management Choices:** Prefer React Query or Zustand for scalable state management instead of prop drilling.\n\nFollowing these best practices will help your React apps stay modern, maintainable, and efficient."
    },
    {
      "id": 4,
      "title": "Why TypeScript is Becoming Essential",
      "body": "TypeScript has gained massive popularity in recent years due to its ability to prevent bugs and improve code maintainability.\n\n- Static Typing: Helps catch errors at compile-time instead of runtime.\n- Better IDE Support: Autocomplete and type inference make development faster.\n- Scalability: Makes large codebases easier to manage.\n- Community & Libraries: Most modern libraries provide TypeScript types, enhancing integration.\n\nFor developers looking to write safer, more robust code, TypeScript is quickly becoming a must-learn language in modern web development."
    },
    {
      "id": 5,
      "title": "How AI is Changing Web Development",
      "body": "Artificial Intelligence is reshaping how we build and interact with web applications.\n\n- Code Assistance: Tools like GitHub Copilot help developers write code faster.\n- Personalization: AI algorithms can deliver customized experiences to users.\n- Automated Testing: AI-powered tools can detect bugs and optimize performance.\n- Chatbots & Virtual Assistants: Improve customer interaction and support.\n\nAI integration in web development is no longer optional; it’s becoming a key skill for modern developers."
    }
  ]
}
